Ran Plan for dir: `terraform/stacks/stackkit-test-dev-ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 127: running "set -e\n\n# Extract repo and PR info from environment\nREPO_ORG=$(echo \"$BASE_REPO_OWNER\" | tr '[:upper:]' '[:lower:]')\nREPO_NAME=$(echo \"$BASE_REPO_NAME\" | tr '[:upper:]' '[:lower:]')\nPR_NUM=$PULL_NUM\nCOMMIT_SHA=$(echo \"$HEAD_COMMIT\" | cut -c1-8)\nTIMESTAMP=$(date -u +%Y%m%d%H%M%S)\nPR_URL=\"https://github.com/${BASE_REPO_OWNER}/${BASE_REPO_NAME}/pull/${PR_NUM}\"\n\n# Check if plan was successful\nif [ -f \"$PLANFILE\" ]; then\n  PLAN_STATUS=\"succeeded\"\n  PLAN_COLOR=\"good\"\n  echo \"✅ Plan succeeded - sending Slack notification\"\nelse\n  PLAN_STATUS=\"failed\"\n  PLAN_COLOR=\"danger\"\n  echo \"❌ Plan failed - sending Slack notification\"\nfi\n\n# Send simplified Slack notification for reliable delivery and easy bot parsing\nSLACK_MESSAGE=\"{\n  \\\"text\\\": \\\"[AI-REVIEW] 🏗️ Terraform Plan $PLAN_STATUS for $REPO_ORG/$REPO_NAME PR #$PR_NUM\\\",\n  \\\"blocks\\\": [\n    {\n      \\\"type\\\": \\\"section\\\",\n      \\\"text\\\": {\n        \\\"type\\\": \\\"mrkdwn\\\",\n        \\\"text\\\": \\\"[AI-REVIEW] 🏗️ *Terraform Plan $PLAN_STATUS* for `$REPO_ORG/$REPO_NAME` <$PR_URL|PR #$PR_NUM>\\\"\n      }\n    },\n    {\n      \\\"type\\\": \\\"context\\\",\n      \\\"elements\\\": [\n        {\n          \\\"type\\\": \\\"plain_text\\\",\n          \\\"text\\\": \\\"action=plan|status=$PLAN_STATUS|repo=$REPO_ORG/$REPO_NAME|pr=$PR_NUM|commit=$COMMIT_SHA|time=$TIMESTAMP\\\"\n        }\n      ]\n    }\n  ]\n}\"\n\ncurl -X POST -H 'Content-type: application/json'             --data \"$SLACK_MESSAGE\"             \"$SLACK_WEBHOOK_URL\"\n\necho \"📤 Plan result sent to Slack\"\necho \"🤖 AI will analyze and comment on this PR shortly...\"\n" in "/atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2": 
✅ Plan succeeded - sending Slack notification
sh: ryu-qqq/stackkit-test: not found

module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.atlantis_test will be created
+ resource "null_resource" "atlantis_test" {
      + id       = (known after apply)
      + triggers = {
          + "timestamp" = (known after apply)
        }
    }

  # module.test_bucket.aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + tags_all                    = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.test_bucket.aws_s3_bucket_lifecycle_configuration.main[0] will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "logs_lifecycle"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_bucket.aws_s3_bucket_server_side_encryption_configuration.main will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_internet_gateway.main will be created
+ resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + tags_all = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.default will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stackkit-test-dev-default-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + tags_all               = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
      + tags_all                             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
+ public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
+ stack_name         = "stackkit-test-dev-ap-northeast-2"
+ test_bucket_arn    = (known after apply)
+ test_bucket_name   = "test-logs"
+ vpc_cidr_block     = "10.0.0.0/16"
+ vpc_id             = (known after apply)

```
</details>

